#pragma once

/*

3. Спроектировать иерархию классов: класс треугольник и его наследники: 
- прямоугольный треугольник, 
- равнобедренный треугольник,
- равносторонний треугольник. 

Определить в базовом классе и переопределить в наследниках методы 
вычисления площади и периметра треугольника каждого типа. 
Элементы-данные фигур объявляются в базовом классе, 
а инициализируются в наследниках (элементы данные: две стороны и угол).

Разработать пошаговый алгоритм решения задачи. 
Разработать UML диаграмму классов. 
Выполнить программную реализацию задания согласно варианту. 
Прототипы классов должны содержаться в отдельном *.h-файле. 
В программе обязательно предусмотреть вывод информации об исполнителе работы (ФИО), 
номере варианта, выбранном уровне сложности и задании. 

Предусмотреть возможность повторного запуска программы (запрос о 
желании выйти из программы, или продолжить работу). 
Если программная реализация предполагает решение нескольких подзадач, 
разработать меню для демонстрации каждой из них. 
Ключевые моменты программы обязательно должны содержать комментарии.

Выполнить задание с условием работы с наследниками через объект базового абстрактного класса. 
Определяемые в базовых классах методы должны быть чисто виртуальными.

*/

